<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"629b956c6829afcf1758d0341d088b39bf0dcaa801ada7721e9e74c1a33f1f57","plan_job_ref":"Job Plan #39 at https://github.com/ExpidusOS/infra/actions/runs/5907934829","plan_hash":"9d110b61a5bf238e6273f13bae4a96a586e5413b4fbc61928f4559d78dcb9c48","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __.__
<details>
<summary>Plan: 9 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.infra-vpc will be created
  + resource "google_compute_network" "infra-vpc" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "infra-us-west1-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + project                                   = (known after apply)
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.infra-subnet will be created
  + resource "google_compute_subnetwork" "infra-subnet" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + ip_cidr_range              = "10.10.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "infra-us-west1-subnet"
      + network                    = "infra-us-west1-vpc"
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = (known after apply)
      + purpose                    = (known after apply)
      + region                     = "us-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

  # google_container_cluster.infra will be created
  + resource "google_container_cluster" "infra" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-west1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "infra-us-west1"
      + network                     = "infra-us-west1-vpc"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = (known after apply)
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "infra-us-west1-subnet"
      + tpu_ipv4_cidr_block         = (known after apply)

      + cluster_autoscaling {
          + enabled = true

          + auto_provisioning_defaults {
              + disk_size       = 100
              + disk_type       = "pd-standard"
              + image_type      = "COS_CONTAINERD"
              + oauth_scopes    = [
                  + "https://www.googleapis.com/auth/logging.write",
                  + "https://www.googleapis.com/auth/monitoring",
                ]
              + service_account = "github-ci@expidusos-infra.iam.gserviceaccount.com"
            }

          + resource_limits {
              + maximum       = 24
              + minimum       = 2
              + resource_type = "cpu"
            }
          + resource_limits {
              + maximum       = 48
              + minimum       = 8
              + resource_type = "memory"
            }
        }

      + monitoring_config {
          + enable_components = (known after apply)

          + managed_prometheus {
              + enabled = true
            }
        }

      + node_config {
          + disk_size_gb      = 25
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = "github-ci@expidusos-infra.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # google_container_node_pool.infra-primary-nodes will be created
  + resource "google_container_node_pool" "infra-primary-nodes" {
      + cluster                     = "infra-us-west1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "infra-us-west1"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = "1.27.3-gke.1700"

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 3
          + min_node_count  = 1
        }

      + node_config {
          + disk_size_gb      = 25
          + disk_type         = "pd-standard"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "n1-standard-1"
          + metadata          = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible       = false
          + service_account   = "github-ci@expidusos-infra.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # helm_release.cert-manager will be created
  + resource "helm_release" "cert-manager" {
      + atomic                     = false
      + chart                      = "cert-manager"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cert-manager"
      + namespace                  = "cert-manager"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.jetstack.io"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "v1.12.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "installCRDs"
          + value = "true"
        }
    }

  # helm_release.external-dns will be created
  + resource "helm_release" "external-dns" {
      + atomic                     = false
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "external-dns"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "6.23.5"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # helm_release.gitlab-operator will be created
  + resource "helm_release" "gitlab-operator" {
      + atomic                     = false
      + chart                      = "gitlab-operator"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "gitlab-operator"
      + namespace                  = "gitlab"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://gitlab.com/api/v4/projects/18899486/packages/helm/stable"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.22.4"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # kubectl_manifest.gitlab will be created
  + resource "kubectl_manifest" "gitlab" {
      + api_version             = "apps.gitlab.com/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "GitLab"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "gitlab"
      + namespace               = "gitlab"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps.gitlab.com/v1beta1
            kind: GitLab
            metadata:
              name: gitlab
              namespace: gitlab
            spec:
              chart:
                values:
                  certmanager-issuer:
                    email: inquiry@midstall.com
                  gitlab:
                    gitaly:
                      persistence:
                        size: 25Gi
                    toolbox:
                      backups:
                        objectStorage:
                          config:
                            key: config
                            secret: gitlab-wasabi-secret
                  global:
                    appConfig:
                      artifacts:
                        bucket: expidusos-gitlab-artifacts-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      backups:
                        bucket: expidusos-gitlab-backups-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      lfs:
                        bucket: expidusos-gitlab-lfs-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      object_store:
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      packages:
                        bucket: expidusos-gitlab-packages-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                      uploads:
                        bucket: expidusos-gitlab-uploads-us-west-1
                        connection:
                          key: connection
                          secret: gitlab-wasabi-secret
                    hosts:
                      domain: expidusos.com
                    ingress:
                      configureCertmanager: true
                    minio:
                      enabled: false
                  postgresql:
                    persistence:
                      primary:
                        size: 5Gi
                        storageClass: standard
                  redis:
                    master:
                      persistence:
                        size: 5Gi
                version: 7.2.4
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_secret.gitlab-wasabi-secret will be created
  + resource "kubernetes_secret" "gitlab-wasabi-secret" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "gitlab-wasabi-secret"
          + namespace        = "gitlab"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Apply #49](https://github.com/ExpidusOS/infra/actions/runs/5907941825)